### **`Ejercicio 1:`**

Utilice el método print para mostrar en pantalla la siguiente
línea:

> *Hola Mundo, esta es mi primera incursión en Python*

In [7]:
print('Hola Mundo, esta es mi primera incursión en Python')

Hola Mundo, esta es mi primera incursión en Python

### **`Ejercicio 2: `**

Ingrese una serie de datos respecto a su información
personal. Esta información debe estar ingresada en variables para su posterior uso.
Ingrese los siguientes datos:

- Su nombre.
- Edad.
- Una lista con sus 3 actividades favoritas.
- ¿Tiene mascotas?

In [2]:
print('Ingrese los siguientes datos solicitados:')
nombre = input('Su Nombre: ')
edad = input('Su Edad: ')
actividades = input('Una lista con sus 3 actividades favoritas, separadas por coma: ')
mascota = input('¿Tiene mascotas?: ')

Ingrese los siguientes datos solicitados:

### **`Ejercicio 3:`**

- Imprima cada variable creada: acceda al segundo elemento de su lista.
- Pida los tipos de datos asociados.
- Interpole los datos en un método print para generar una presentación sobre usted

In [10]:
print(type(nombre))
print(type(edad))
print(type(actividades))
print(type(mascota))

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

In [3]:
lista_actividades = actividades.split(',')
lista_actividades

print(f'''Hola, mi nombre es {nombre}, tengo {edad} años, mis pasatiempos son {lista_actividades[0]},
{lista_actividades[1]} y {lista_actividades[2]}. Ademas, {mascota} tengo mascotas.''')

Hola, mi nombre es Alfonso, tengo 37 años, mis pasatiempos son Musica,
Programacion y Futbol. Ademas, si tengo mascotas.

### **`Ejercicio 4:`**

A continuación se presenta una serie de códigos que generan errores. Corríjalos y comente cuáles fueron las fallas.

In [ ]:
print('Estaba la pájara pinta sentada en el verde limón)

El problema acá es que falta una comilla al final de la oracion, antes del parentesis.

In [ ]:
print('Mi nombre es' name 'y tengo' edad, 'años')

El problema acá es que falta darle el formato F-string para poder visualizar el valor de variables llamadas

In [ ]:
import pandas as pd
import numpy as np

Acá no hay ningun problema, ya que las librerias se importan de manera correcta, ademas de darles la abreviatura correcta

In [ ]:
"Ornitorrinco" + 45

El problema acá es que no se pueden sumar tipos de datos diferentes. El primer valor es un string (o objecto) mientras que el segunto es un varieable de tipo entero.

### **`Ejercicio 5:`**

Utilizar pandas y numpy. Para ello, sigue los siguientes pasos.

1. Importa pandas y numpy.

In [2]:
import pandas as pd
import numpy as np
import os

2. Posteriormente importa el archivo flights.csv.

In [12]:
os.listdir()

['01_Desafio_guiado_-_Introduccion_al_ambiente_de_trabajo.pdf',
 '01_Desafio_guiado_-_introducción_ambiente_trabajo.ipynb',
 '02_Desafío_evaluado_-_Control_de_Flujo.pdf',
 'flights.csv']

In [3]:
df_flights = pd.read_csv('flights.csv')

3. Solicita las primeras y últimas 5 observaciones de la tabla de datos.

In [25]:
print('Primeras 5 Observaciones:')
display(df_flights.head(5))
print('\nUltimas 5 Observaciones:')
display(df_flights.tail(5))

Primeras 5 Observaciones:

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

Ultimas 5 Observaciones:

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

Por defecto, ambos métodos nos traen 5 registros:

In [16]:
print('Primeras 5 Observaciones:')
df_flights.head()

Primeras 5 Observaciones:

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [18]:
print('\nUltimas 5 Observaciones:')
df_flights.tail()

Ultimas 5 Observaciones:

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

4. Utiliza **`describe()`** para obtener las medidas univariadas de la columna year.

In [19]:
# Calculo sobre solo las variables numericas
df_flights.describe()

              year  passengers
count   144.000000  144.000000
mean   1954.500000  280.298611
std       3.464102  119.966317
min    1949.000000  104.000000
25%    1951.750000  180.000000
50%    1954.500000  265.500000
75%    1957.250000  360.500000
max    1960.000000  622.000000

In [20]:
# Calculo sobre solo todas las variables
df_flights.describe(include='all')

               year    month  passengers
count    144.000000      144  144.000000
unique          NaN       12         NaN
top             NaN  January         NaN
freq            NaN       12         NaN
mean    1954.500000      NaN  280.298611
std        3.464102      NaN  119.966317
min     1949.000000      NaN  104.000000
25%     1951.750000      NaN  180.000000
50%     1954.500000      NaN  265.500000
75%     1957.250000      NaN  360.500000
max     1960.000000      NaN  622.000000

In [22]:
# Calculo sobre solo las variables string
df_flights.describe(include=['O'])

          month
count       144
unique       12
top     January
freq         12

In [23]:
# Filtra la columna y luego aplica el metodo
df_flights['year'].describe()

count     144.000000
mean     1954.500000
std         3.464102
min      1949.000000
25%      1951.750000
50%      1954.500000
75%      1957.250000
max      1960.000000
Name: year, dtype: float64

In [23]:
# Calcula el metodo sobre todo el DF y luego filtra la columna
df_flights.describe()['year']

count     144.000000
mean     1954.500000
std         3.464102
min      1949.000000
25%      1951.750000
50%      1954.500000
75%      1957.250000
max      1960.000000
Name: year, dtype: float64

In [24]:
# Nos entrega todos los percentiles indicados
df_flights['year'].describe(percentiles=[0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9])

# Por ejemplo: el Percentil 40 se lee de la siguiente manera:
# Donde el 40% de los datos de la columna'year' corresponden o son menores al año '1953'.

# Por ejemplo la desviacion estandar se lee de la siguiente manera:
# Aproximadamente la dispersion numerica entre los años es de 3,46, es decir, existe una separacion de 3,5 años aprox entre cada 
# año del conjunto de datos con respecto al promedio

count     144.000000
mean     1954.500000
std         3.464102
min      1949.000000
10%      1950.000000
20%      1951.000000
30%      1952.000000
40%      1953.000000
50%      1954.500000
60%      1956.000000
70%      1957.000000
80%      1958.000000
90%      1959.000000
max      1960.000000
Name: year, dtype: float64

5. Utiliza **`value_counts()`** para obtener la frecuencia de meses y años de la tabla.

In [30]:
display(df_flights['year'].value_counts())

df_flights['month'].value_counts()

1960    12
1959    12
1958    12
1957    12
1956    12
1955    12
1954    12
1953    12
1952    12
1951    12
1950    12
1949    12
Name: year, dtype: int64

February     12
May          12
July         12
April        12
September    12
December     12
June         12
October      12
November     12
August       12
January      12
March        12
Name: month, dtype: int64

In [4]:
# Calcula el total de c/u con respecto al total. Es decir: 12/144 = 0,083333
df_flights['month'].value_counts(normalize=True)

January      0.083333
February     0.083333
March        0.083333
April        0.083333
May          0.083333
June         0.083333
July         0.083333
August       0.083333
September    0.083333
October      0.083333
November     0.083333
December     0.083333
Name: month, dtype: float64

In [7]:
# Ordena las categorias por orden alfabetico. Ordena por el indice
df_flights['month'].value_counts().sort_index()

April        12
August       12
December     12
February     12
January      12
July         12
June         12
March        12
May          12
November     12
October      12
September    12
Name: month, dtype: int64

6. Guarda en variables las primeras y últimas 15 observaciones de la tabla.

In [ ]:
primeras_15 = df_flights[:15]
primeras_15

    year      month  passengers
0   1949    January         112
1   1949   February         118
2   1949      March         132
3   1949      April         129
4   1949        May         121
5   1949       June         135
6   1949       July         148
7   1949     August         148
8   1949  September         136
9   1949    October         119
10  1949   November         104
11  1949   December         118
12  1950    January         115
13  1950   February         126
14  1950      March         141

In [ ]:
ultimas_15 = df_flights[-15:]
ultimas_15

     year      month  passengers
129  1959    October         407
130  1959   November         362
131  1959   December         405
132  1960    January         417
133  1960   February         391
134  1960      March         419
135  1960      April         461
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [8]:
primeras_15 = df_flights.head(15)
ultimas_15 = df_flights.tail(15)

7. Solicita la media, mediana y desviación estándar de la cantidad de pasajeros utilizando los métodos de numpy. Replique el procedimiento para las últimas y primeras 15 observaciones. Comente brevemente los resultados.

In [12]:
var = df_flights['passengers']
mean = np.mean(var)
median = np.median(var)
desv = np.std(var)
print(f'Estadísticas para todas las observaciones: \nmedia: {mean}, \nmediana: {median} \ndesviacion estandard: {desv}')

Estadísticas para todas las observaciones:
media: 280.2986111111111,
mediana: 265.5
desviacion estandard: 119.54904153277148

In [13]:
var = primeras_15['passengers']
mean = np.mean(var)
median = np.median(var)
desv = np.std(var)
print(f'Estadísticas para las primeras 15 observaciones: \nmedia: {mean}, \nmediana: {median} \ndesviacion estandard: {desv}')

Estadísticas para las primeras 15 observaciones:
media: 126.8,
mediana: 126.0
desviacion estandard: 12.681745410891462

In [14]:
var = ultimas_15['passengers']
mean = np.mean(var)
median = np.median(var)
desv = np.std(var)
print(f'Estadísticas para las ultimas 15 observaciones: \nmedia: {mean}, \nmediana: {median} \ndesviacion estandard: {desv}')

Estadísticas para las ultimas 15 observaciones:
media: 459.2,
mediana: 432.0
desviacion estandard: 75.29426715671431

De manera eficiente podemos crear una función que nos realice el calculo:

In [19]:
def estadisticos(df, var):
    mean = np.mean(df[var])
    median = np.median(df[var])
    desv = np.std(df[var])   
    print(f'Estadísticas para las ultimas 15 observaciones: \nmedia: {mean}, \nmediana: {median} \ndesviacion estandard: {desv}')

In [20]:
estadisticos(df_flights, 'passengers')

Estadísticas para las ultimas 15 observaciones:
media: 280.2986111111111,
mediana: 265.5
desviacion estandard: 119.54904153277148

In [21]:
# Si llegasemos a necesitar retornar estos valores
def estadisticos(df, var):
    mean = np.mean(df[var])
    median = np.median(df[var])
    desv = np.std(df[var])   
    return mean, median, desv

In [22]:
estadisticos(df_flights, 'passengers')

(280.2986111111111, 265.5, 119.54904153277148)